# Pandas: Conexión a MySQL

## Opción 1: mysql connector de forma directa

pip install mysql-connector-python

In [21]:
import pandas as pd
import mysql.connector as connector

In [28]:
connection = connector.connect(
    host="localhost",
    port="3306",
    user="root",
    password="Admin",
    database="world"
)

In [29]:
df_city = pd.read_sql("SELECT * FROM city;", connection)
df_country = pd.read_sql("SELECT * FROM country;", connection)
df_lang = pd.read_sql("SELECT * FROM countrylanguage;", connection)

C:\Users\funda\AppData\Local\Temp\ipykernel_3392\2553972598.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_city = pd.read_sql("SELECT * FROM city;", connection)
C:\Users\funda\AppData\Local\Temp\ipykernel_3392\2553972598.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_country = pd.read_sql("SELECT * FROM country;", connection)
C:\Users\funda\AppData\Local\Temp\ipykernel_3392\2553972598.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_lang = pd.read_sql("SELECT * FROM countrylanguage;", connection)

In [30]:
df_city.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

In [31]:
df_country.head()

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,José Eduardo dos Santos,56.0,AO
3,AIA,Anguilla,North America,Caribbean,96.0,NaN,8000,76.1,63.2,NaN,Anguilla,Dependent Territory of the UK,Elisabeth II,62.0,AI
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,Shqipëria,Republic,Rexhep Mejdani,34.0,AL

In [32]:
df_lang.head()

  CountryCode    Language IsOfficial  Percentage
0         ABW       Dutch          T         5.3
1         ABW     English          F         9.5
2         ABW  Papiamento          F        76.7
3         ABW     Spanish          F         7.4
4         AFG     Balochi          F         0.9

In [33]:
connection.close()

## Opción 2: Framework SQLAlchemy

pip install mysql-connector-python

pip install sqlalchemy

In [57]:
from sqlalchemy import create_engine
import pandas as pd

In [58]:
url = 'mysql+mysqlconnector://root:Admin@localhost:3306/world'
engine = create_engine(url)

In [59]:
df_city = pd.read_sql("SELECT * FROM city;", engine)
df_country = pd.read_sql("SELECT * FROM country;", engine)
df_lang = pd.read_sql("SELECT * FROM countrylanguage;", engine)

In [38]:
df_city.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

## Utilizar columna como índice

In [41]:
df_city = pd.read_sql("SELECT * FROM city;", engine, index_col='ID')

In [42]:
df_city.tail()

            Name CountryCode    District  Population
ID
4075  Khan Yunis         PSE  Khan Yunis      123175
4076      Hebron         PSE      Hebron      119401
4077    Jabaliya         PSE  North Gaza      113901
4078      Nablus         PSE      Nablus      100231
4079       Rafah         PSE       Rafah       92020

## Insertar filas en DataFrame

In [133]:
df_city = pd.read_sql("SELECT * FROM city;", engine)
df_city.tail()

        ID        Name CountryCode    District  Population
4074  4075  Khan Yunis         PSE  Khan Yunis      123175
4075  4076      Hebron         PSE      Hebron      119401
4076  4077    Jabaliya         PSE  North Gaza      113901
4077  4078      Nablus         PSE      Nablus      100231
4078  4079       Rafah         PSE       Rafah       92020

### Opción 1: loc

loc permite seleccionar en base al índice explícito

In [142]:
df_city = pd.read_sql("SELECT * FROM city;", engine)
df_city.tail()

        ID        Name CountryCode    District  Population
4074  4075  Khan Yunis         PSE  Khan Yunis      123175
4075  4076      Hebron         PSE      Hebron      119401
4076  4077    Jabaliya         PSE  North Gaza      113901
4077  4078      Nablus         PSE      Nablus      100231
4078  4079       Rafah         PSE       Rafah       92020

In [135]:
count = len(df_city.index)
count

4079

In [138]:
df_city.loc[count] = [None, 'Tomelloso', 'ESP', 'Tomelloso', 5]

In [137]:
df_city.tail()

        ID       Name CountryCode    District  Population
4075  4076     Hebron         PSE      Hebron      119401
4076  4077   Jabaliya         PSE  North Gaza      113901
4077  4078     Nablus         PSE      Nablus      100231
4078  4079      Rafah         PSE       Rafah       92020
4079  None  Tomelloso         ESP   Tomelloso           5

## Insertar DataFrame en Base de datos

In [140]:
df_city.to_sql(name='city2', con=engine, if_exists='append', index=False)

4080

In [143]:
df_city.to_sql(name='city3', con=engine, if_exists='append', index=True)

4079

## Crear tabla desde Python

### Opción 1: mysql connector

In [163]:
import mysql.connector as connector

In [164]:
connection = connector.connect(
    host="localhost",
    port="3306",
    user="root",
    password="Admin",
    database="world"
)

cursor = connection.cursor()

sql = """ 
    CREATE TABLE IF NOT EXISTS city2 (
        `ID` BIGINT AUTO_INCREMENT PRIMARY KEY,
        Name char(35) NOT NULL DEFAULT '',
        CountryCode char(3) NOT NULL DEFAULT '',
        District char(20) NOT NULL DEFAULT '',
        Population int NOT NULL DEFAULT '0',
        FOREIGN KEY (CountryCode) REFERENCES country (Code)
    );
"""
cursor.execute(sql)
connection.commit()
cursor.close()
connection.close()

In [173]:
df_city = pd.read_sql("SELECT * FROM city;", engine, index_col='ID')
df_city.head()

              Name CountryCode       District  Population
ID
1            Kabul         AFG          Kabol     1780000
2         Qandahar         AFG       Qandahar      237500
3            Herat         AFG          Herat      186800
4   Mazar-e-Sharif         AFG          Balkh      127800
5        Amsterdam         NLD  Noord-Holland      731200

In [161]:
# borrar columna
# df_city.drop('ID', axis=1)

In [172]:
df_city.to_sql(name='city2', con=engine, if_exists='append', index=True)

4079